Revit 2027 API
View3D.OrientTo Method
 Reorients the view to align with the forward direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void OrientTo(
	XYZ forwardDirection
)
Public Sub OrientTo (
	forwardDirection As XYZ
)
public:
void OrientTo(
	XYZ^ forwardDirection
)
member OrientTo :
        forwardDirection : XYZ -> unit
Parameters
forwardDirection XYZ
 The forward direction.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  forwardDirection has zero length.
InvalidOperationException |  View is locked and cannot be reoriented.
Remarks
 This method adjusts the ViewOrientation to align with the input forward direction. The eye position will be automatically determined based on the shape of the viewing area and size of the model. The UpDirection will be aligned with the project Z axis.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace